# Koşullu Eleman İşlemleri

In [87]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m, columns = ["var1","var2", "var3"])
df

   var1  var2  var3
0    26     4    23
1    23     6    24
2    17    12     6
3    26     1    22
4     3    10    14
5     1    12    12
6    25     6    21
7    18     4    28
8    12     3     1
9    17    18     7

In [80]:
df["var1"]

0    23
1     3
2    12
3    28
4     7
5     7
6     6
7    11
8    15
9    25
Name: var1, dtype: int32

In [81]:
df["var1"][0:2]

0    23
1     3
Name: var1, dtype: int32

In [82]:
df.var1

0    23
1     3
2    12
3    28
4     7
5     7
6     6
7    11
8    15
9    25
Name: var1, dtype: int32

In [86]:
df[df.var1 > 15]["var1"]

0    23
3    28
9    25
Name: var1, dtype: int32

In [91]:
df[(df.var1 > 15) & (df.var3 < 7)]

   var1  var2  var3
2    17    12     6

In [93]:
df.loc[(df.var1 > 15), ["var2","var3"]]

   var2  var3
0     4    23
1     6    24
2    12     6
3     1    22
6     6    21
7     4    28
9    18     7

In [95]:
#alternatif
df[(df.var1 > 15)][["var2","var3"]]

   var2  var3
0     4    23
1     6    24
2    12     6
3     1    22
6     6    21
7     4    28
9    18     7